# Data Investigation with Pandas Assignment

## 1.0 Importing our Libraries

In [2]:
# Importing the libraries we will need

# Importing the pandas library
import pandas as pd
# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.

In [3]:
# Let's read the data from the CSV file and create the dataframe to be used
#
df = pd.read_csv("Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv")

## 1.2 Previewing our Dataset

In [4]:
# Let's preview the first 10 rows of our data
#
df.head(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4
5,NAIROBI WEST,Urban,5,7547,7660,15207,Nairobi,NAIROBI,5
6,NAIROBI WEST,Urban,6,6966,7082,14048,Nairobi,NAIROBI,6
7,NAIROBI WEST,Urban,7,6511,6674,13185,Nairobi,NAIROBI,7
8,NAIROBI WEST,Urban,8,6171,6489,12660,Nairobi,NAIROBI,8
9,NAIROBI WEST,Urban,9,6361,6662,13023,Nairobi,NAIROBI,9

## 1.3 Accessing Information about our Dataset

In [5]:
# We can getting to know more about the dataset by accessing its information
#
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  object
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [7]:
# Challenge 1
# What wadf['Age_years'].unique()s the average age of a person of Kenya?
#
df['Age_years'].unique()

array(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12',
       '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23',
       '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34',
       '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45',
       '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56',
       '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67',
       '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78',
       '79', '80+', 'Age NS'], dtype=object)

In [8]:
#number of rows that have Age NS
df1=df[df['Age_years']=='Age NS']
df1.shape

(310, 9)

In [9]:
#number of rows with 80+
df2 = df[df['Age_years']=='80+']
df2.shape

(310, 9)

In [10]:
#values convertible to integers
values = df.loc[(df['Age_years']!='Age NS') & (df['Age_years']!='80+')]
values.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24800 entries, 0 to 25417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     24800 non-null  object
 1   Urban/Rural  24800 non-null  object
 2   Age_years    24800 non-null  object
 3   Male         24800 non-null  int64
 4   Female       24800 non-null  int64
 5   Total        24800 non-null  int64
 6   County       24800 non-null  object
 7   Province     24800 non-null  object
 8   OBJECTID     24800 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.9+ MB

In [12]:
#changing the values to integer
values['Age_years'] = pd.to_numeric(values['Age_years'])
values.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24800 entries, 0 to 25417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     24800 non-null  object
 1   Urban/Rural  24800 non-null  object
 2   Age_years    24800 non-null  int64
 3   Male         24800 non-null  int64
 4   Female       24800 non-null  int64
 5   Total        24800 non-null  int64
 6   County       24800 non-null  object
 7   Province     24800 non-null  object
 8   OBJECTID     24800 non-null  int64
dtypes: int64(5), object(4)
memory usage: 1.9+ MB

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\3092843064.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  values['Age_years'] = pd.to_numeric(values['Age_years'])

In [13]:
#average mean of a person in kenya
values['Age_years'].mean()

39.5

In [14]:
# Challenge 2
# What was the average female population in Kenya?
#
df['Female'].mean()

763.8725019669552

In [16]:
# Challenge 3
# What was the average male population in Kenya?
#
df['Male'].mean()

755.0140833988985

In [17]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
#
df.groupby("District").sum().sort_values("Total", ascending=False).head()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\1359449156.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("District").sum().sort_values("Total", ascending=False).head()

                 Male  Female    Total  OBJECTID
District
NAIROBI EAST   582554  561862  1144416     10045
NAIROBI NORTH  545701  516385  1062086     16769
NAIROBI WEST   352227  332538   684765      3321
SIAYA          257711  292513   550224   2009943
MOLO           271954  270149   542103   2723138

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
#

In [18]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
#
df.groupby("District").sum().sort_values("Total", ascending=False).tail()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\1088398921.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("District").sum().sort_values("Total", ascending=False).tail()

                 Male  Female  Total  OBJECTID
District
SAMBURU NORTH   31471   28330  59801   2400386
SAMBURU EAST    29011   30083  59094   2386938
MARSABIT        23305   23197  46502   1485922
GARBATULLA      23314   19804  43118   1553162
LAIKIPIA NORTH  16928   15834  32762   2642450

In [33]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
#
df1=df.groupby("County").sum().sort_values("Total", ascending=False).head(1)
df1.mean()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\2651221071.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df1=df.groupby("County").sum().sort_values("Total", ascending=False).head(1)

Male        1605230.0
Female      1533139.0
Total       3138369.0
OBJECTID      53628.0
dtype: float64

In [35]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
#
df2=df.groupby("County").sum().sort_values("Total", ascending=False).tail(1)
df2.mean()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\3739834799.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2=df.groupby("County").sum().sort_values("Total", ascending=False).tail(1)

Male          53045.0
Female        48494.0
Total        101539.0
OBJECTID    1445578.0
dtype: float64

In [36]:
# Challenge 9
# What was the total population of Busia County?
#
df3 = df.groupby("County").sum().sort_values("Total", ascending=False)
df3 = df.loc[df['County'] == 'Busia']
df3['Total'].sum()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\2957138621.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df3 = df.groupby("County").sum().sort_values("Total", ascending=False)

743946

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
#

In [60]:
# Challenge 11
# What was the Total population of Teso South District?
#
df4 = df.groupby("District").sum().sort_values("Total", ascending=False)
df4= df.loc[df['District'] == 'TESO SOUTH']
df4['Total'].sum()

C:\Users\pc\AppData\Local\Temp\ipykernel_12428\3112741316.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df4 = df.groupby("District").sum().sort_values("Total", ascending=False)

137924

In [45]:
# Challenge 12
# What was the urban population of Teso South District?
#
df3 = df.loc[df['District'] == 'TESO SOUTH']
df6 = df3.loc[df3['Urban/Rural'] == 'Urban']
df6.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
12874,TESO SOUTH,Urban,0,489,482,971,Busia,WESTERN,12874
12875,TESO SOUTH,Urban,1,395,387,782,Busia,WESTERN,12875
12876,TESO SOUTH,Urban,2,402,400,802,Busia,WESTERN,12876
12877,TESO SOUTH,Urban,3,407,445,852,Busia,WESTERN,12877
12878,TESO SOUTH,Urban,4,347,403,750,Busia,WESTERN,12878

In [59]:
df6['Total'].sum()

111762

In [49]:
# Challenge 13
# What was the rural population of Teso South District?
#
df3 = df.loc[df['District'] == 'TESO SOUTH']
df6 = df3.loc[df3['Urban/Rural'] == 'Rural']
df6.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25338,TESO SOUTH,Rural,0,2091,2116,4207,Busia,WESTERN,25338
25339,TESO SOUTH,Rural,1,1947,1978,3925,Busia,WESTERN,25339
25340,TESO SOUTH,Rural,2,2216,2180,4396,Busia,WESTERN,25340
25341,TESO SOUTH,Rural,3,2104,2113,4217,Busia,WESTERN,25341
25342,TESO SOUTH,Rural,4,2062,2060,4122,Busia,WESTERN,25342

In [58]:
df6['Total'].sum()

111762

In [57]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#convert to integer

In [ ]:
# Challenge 15
# What was the urban population in Kenya?
#